app/models/user.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def welcome_msg
    ActionJob.set(wait: 3.seconds).perform_later(User.last)